TexasInstruments/mcupsdk-core/test/kernel/freertos/am261x-lp/r5fss0-0_freertos_mpu/example.syscfg
section14.$name                                    = "Privileged Data Segments";
section14.load_memory                              = "PRIVILEGED_DATA";
section14.group_start                              = "__privileged_data_start__";
section14.group_end                                = "__privileged_data_end__";
section14.output_section.create(1);
section14.output_section[0].$name                  = ".privileged_data";
section14.output_section[0].palignment             = true;
section14.output_section[0].input_section.create(1);
section14.output_section[0].input_section[0].$name = "*(privileged_data)";

section15.$name                                   = "User Text & Data Sections ";
section15.load_memory                             = "R5F_TCMA";
section15.output_section.create(3);
section15.output_section[0].macro_name            = "TEXTFREERTOS_MPU_UTUSER1_SECTION";
section15.output_section[0].output_sections_start = "__TEXT_FREERTOS_MPU_UT_USER1_START";
section15.output_section[0].output_sections_end   = "__TEXT_FREERTOS_MPU_UT_USER1_END";
section15.output_section[0].$name                 = ".text.freertos_mpu_ut.user1";
section15.output_section[0].alignment             = 1024;
section15.output_section[1].output_sections_start = "__TEXT_FREERTOS_MPU_UT_USER2_START";
section15.output_section[1].output_sections_end   = "__TEXT_FREERTOS_MPU_UT_USER2_END";
section15.output_section[1].$name                 = ".text.freertos_mpu_ut.user2 ";
section15.output_section[1].alignment             = 1024;
section15.output_section[2].$name                 = ".data.freertos_mpu_ut";
section15.output_section[2].alignment             = 32;
section15.output_section[2].palignment            = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
timer1.RTI.$suggestSolution = "RTI2";
